app/Controllers/News.php

INSERT INTO `news` (`title`, `slug`, `body`) VALUES ('Como treinar o seu dragão', 'como-treinar-o-seu-dragão', 'Aqui você irá aprender como treinar o seu dragão de forma eficiente.')
---
    public function create()
    {
        $model = model(NewsModel::class);

        if ($this->request->getMethod() === 'post' && $this->validate([
            'title' => 'required|min_length[3]|max_length[255]',
            'body'  => 'required',
        ])) {
            $model->save([
                'title' => $this->request->getPost('title'),
                'slug'  => url_title($this->request->getPost('title'), '-', true),
                'body'  => $this->request->getPost('body'),
            ]);